app/views/shared/_usuario_info.html.erb

SELECT COUNT(*) FROM "microvideos" WHERE "microvideos"."usuario_id" = ?  [["usuario_id", 1]]
---
<span>
  <%= pluralize(current_usuario.microvideos.count, "microvideo") %>

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."usuario_id" = ?  [["usuario_id", 101]]
---
<span>
  <%= pluralize(current_usuario.microposts.count, "micropost") %>