app/views/usuarios/show.html.erb

  <div class="span8">
    <% if @usuario.microvideos.any? %>
---
SELECT 1 AS one FROM "microvideos" WHERE "microvideos"."usuario_id" = ? ORDER BY created_at DESC LIMIT 1  [[nil, 1]]

  <div class="span8">
    <% if @usuario.microposts.any? %>
---
SELECT 1 AS one FROM "microposts" WHERE "microposts"."usuario_id" = ? ORDER BY created_at DESC LIMIT 1  [["usuario_id", 101]]