app/controllers/sessions_controller.rb

  def create
    usuario = Usuario.find_by(email: params[:session][:email].downcase)
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."email" = 'noeldiazmesa@hotmail.com' LIMIT 1