app/controllers/static_pages_controller.rb

  def home
  	if signed_in?
      @microvideo  = current_usuario.microvideos.build
      @feed_items = current_usuario.feed.paginate(page: params[:page])
      @micropost  = current_usuario.microposts.build
      @feed_items2 = current_usuario.feed2.paginate(page: params[:page])
---
SELECT "microvideos".* FROM "microvideos" WHERE "microvideos"."usuario_id" = ? ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["usuario_id", 1]]
SELECT COUNT(*) FROM "microvideos" WHERE "microvideos"."usuario_id" = ?  [["usuario_id", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."usuario_id" = ?  [["usuario_id", 101]]